Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: By using the `io.quarkus.vertx.core.runtime.context.VertxContextSafetyToggle` class, the current context can be explicitly marked as `safe`, or it can be explicitly marked as `unsafe`; there's a third state which is the default of any new context: `unmarked`. The default is to consider any unmarked context to be `unsafe`, unless the system property `io.quarkus.vertx.core.runtime.context.VertxContextSafetyToggle.UNRESTRICTED_BY_DEFAULT` is set to `true`;
ja_jp: `io.quarkus.vertx.core.runtime.context.VertxContextSafetyToggle` クラスを使用すると、現在のコンテキストを明示的に `safe` または `unsafe` としてマークできます。さらに、新規コンテキストのデフォルトの状態である `unmarked` もあります。 デフォルトでは、システムプロパティー `io.quarkus.vertx.core.runtime.context.VertxContextSafetyToggle.UNRESTRICTED_BY_DEFAULT` が `true` に設定されていない限り、マークされていないコンテキストは `unsafe` とみなされます。

source: By using the properties mentioned in the previous section to configure three different datasources, inject each one of them as follows:
ja_jp: 前のセクションで述べたプロパティを使用して3つの異なるデータソースを設定し、それぞれのデータソースに以下のように注入します：

source: By using the secret below as an example, create a secret with the keystores and truststores to use Kubernetes secrets:
ja_jp: 以下のシークレットを例として、Kubernetes シークレットを使用するためのキーストアとトラストストアが含まれるシークレットを作成します。

source: By using these build items appropriately, you can generate and manage resources effectively within your Quarkus extension.
ja_jp: これらのビルド項目を適切に使用することで、Quarkus エクステンション内でリソースを効果的に生成および管理できます。

source: By using this mutation we have created a `Hero` entity in our service.
ja_jp: このミューテーションを利用することで、私たちのサービスに `Hero` エンティティを作成しました。

source: ByteBuddy is an amazing library and this blog post should not be seen as a critique of ByteBuddy. This is an extreme corner case that doesn't happen with standard bytecode.
ja_jp: ByteBuddyは素晴らしいライブラリであり、このブログ記事はByteBuddyの批評として見るべきではありません。これは標準的なバイトコードでは起きない極端なコーナーケースです。

source: Bytecode Recording
ja_jp: バイトコード記録

source: Bytecode transformation
ja_jp: バイトコード変換

source: Bytes sent, excluding HTTP headers
ja_jp: HTTP ヘッダーを除く送信済みバイト数

source: Bytes sent, excluding HTTP headers, or '-' if no bytes were sent
ja_jp: HTTP ヘッダーを除く送信済みバイト数。送信されなかった場合は '-' 。

source: CCTV security camera domain model:
ja_jp: CCTV セキュリティーカメラドメインモデル:

source: CDI (Context Dependency Injection) will manage the exporters to use, according to the selected protocol or when applications implement their own CDI exporter, like in tests.
ja_jp: CDI (Context Dependency Injection) は、選択されたプロトコルに応じて、またはテストのようにアプリケーションが独自の CDI エクスポーターを実装する場合に、使用するエクスポーターを管理します。

source: CDI @Inject with Kotlin
ja_jp: Kotlinでの CDI @Inject

source: CDI Beans
ja_jp: CDI ビーン

source: CDI Integration
ja_jp: CDIの統合

source: CDI Integration Guide
ja_jp: CDI 統合ガイド

source: CDI Reference
ja_jp: CDIリファレンス

source: CDI `@Alternative` mechanism.
ja_jp: CDI `@Alternative` メカニズム

source: CDI alternatives are only considered during injection and type-safe resolution. For example the default implementation would still receive observer notifications.
ja_jp: CDI の代替 Beanは、インジェクションと型安全解決の間のみ考慮されます。例えば、デフォルトの実装では、オブザーバー通知を受け取ることになります。

source: CDI asynchronous observers (`@ObservesAsync`) are not aware of reactive programming and are not meant to be used as part of reactive pipelines. The observer methods are meant to be synchronous, they are just offloaded to a thread pool.
ja_jp: CDI 非同期オブザーバー (`@ObservesAsync`) はリアクティブプログラミングを認識しないため、リアクティブパイプラインの一部として使用できません。 オブザーバーメソッドは同期されることを意図しており、スレッドプールにオフロードされるだけです。

source: CDI beans are also automatically registered for all injected https://smallrye.io/smallrye-config/Main/config/mappings/[Config Mappings]. The mappings are populated with the test configuration properties.
ja_jp: また、CDI Bean は、注入されたすべての https://smallrye.io/smallrye-config/Main/config/mappings/[Config Mappings] に対して自動的に登録されます。マッピングには、テスト設定プロパティーが入力されます。

source: CDI events
ja_jp: CDI イベント

source: CDI injection is not supported in the `@QuarkusMainTest` tests. Consequently, mocking CDI beans with `QuarkusMock` or `@InjectMock` is not supported either.
ja_jp: CDI インジェクションは `@QuarkusMainTest` テストではサポートされていません。 そのため、 `QuarkusMock` や `@InjectMock` を使用して CDI Bean をモックすることもサポートされていません。

source: CDI integration
ja_jp: CDI統合

source: CDI introduces the notion of CDI Lite and Build Compatible Extensions (BCE), which enable standard extensions that are compatible across CDI implementations and reap the benefits of Quarkus build time optimizations.
ja_jp: CDIは、CDI LiteとBCE（Build Compatible Extensions）という概念を導入しており、CDI実装間で互換性のある標準エクステンションを実現し、Quarkusのビルド時最適化の恩恵を受けることができます。

source: CDI is a purely synchronous framework. Its notion of asynchrony is very limited and based solely on thread pools and thread offloading. Therefore, there is a number of pitfalls when using CDI together with reactive programming.
ja_jp: CDI は単なる同期フレームワークです。 非同期の概念は非常に限られており、スレッドプールとスレッドオフロードのみに基づいています。 したがって、CDI をリアクティブプログラミングと組み合わせて使用すると、いくつかの落とし穴が生じます。

source: CDI request scope
ja_jp: CDI リクエストスコープ

source: CDI scopes
ja_jp: CDI スコープ

source: CEL allows expression based policy validation of Kubernetes resources, and this requirement is implemented by operators... which are _generally_ written in Go :-)
ja_jp: CEL を使用すると、Kubernetes リソースの式ベースのポリシー検証が可能になります。この要件はオペレーターによって実装されますが、それらは _通常_ Go で記述されています :-)

source: CI for native builds
ja_jp: ネイティブビルドのためのCI

source: CI/CD orchestrates all services together rather than each one separately
ja_jp: CI/CDは、すべてのサービスを個別にではなく、まとめてオーケストレーションします

source: CLI
ja_jp: コマンドラインインタフェース

source: CLI plugins
ja_jp: CLIプラグイン

source: CONFIGURATION
ja_jp: 設定

source: CONTRIBUTORS
ja_jp: コントリビューター

source: CORS filter
ja_jp: CORS フィルター

source: CORS-Origin handler of the management router.
ja_jp: 管理ルーターのCORS-Originハンドラ。

source: CPU & Memory limits and requests can be applied to a `Container` (more info in https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/[Kubernetes documentation]) using the following configuration:
ja_jp: CPUやメモリの制限やリクエストは、以下の設定で `Container` (詳細は https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/[Kubernetes のドキュメント] を参照) に適用することができます。

source: CPU time used by the process as reported by the JVM.
ja_jp: JVM によって報告されるプロセスで使用された CPU 時間。

source: CRON Config Property Example
ja_jp: CRON 設定プロパティーの例

source: CRON Config Property Example with default `0 0 15 ? * MON *`
ja_jp: デフォルト値が `0 0 15 ? * MON *` のCRON設定プロパティーの例

source: CRON Trigger Example
ja_jp: CRONトリガーの例

source: CRUD w/ Hibernate
ja_jp: HibernateによるCRUD

source: CSRF Request Header
ja_jp: CSRFリクエスト・ヘッダー

source: CSRF considerations
ja_jp: CSRF に関する考慮事項

source: CSS styles can be added using the `css` function, and these styles only apply to your component.
ja_jp: CSS スタイルは `css` 関数を使用して追加でき、これらのスタイルはコンポーネントにのみ適用されます。

source: Cache configuration can be provided in XML, JSON or YAML. Use the Infinispan Console and the cache configuration Wizard to learn more about Infinispan Caches and create guided configurations.
ja_jp: キャッシュ設定は、XML、JSON、または YAML で提供することができます。Infinispan コンソールおよびキャッシュ設定ウィザードを使用して、Infinispan キャッシュの詳細について学び、ガイド付きの設定を作成してください。

source: Cache invalidation is performed *after* the annotated method completes successfully. If the method throws an exception, the cache will *not* be invalidated.
ja_jp: キャッシュの無効化は、アノテーションされたメソッドが正常に完了した *後* に実行されます。メソッドが例外をスローした場合、キャッシュは *無効化されません*。

source: Cache keys are built by the annotations API using the following logic:
ja_jp: キャッシュキーはアノテーションAPIにより、以下のロジックで構築されます。

source: Cache keys building logic
ja_jp: キャッシュキー構築ロジック

source: Cache your application data
ja_jp: アプリケーションデータのキャッシュ

source: CacheKeyGenerator for cache extension
ja_jp: キャッシュエクステンションのためのCacheKeyGenerator

source: Cached Section
ja_jp: キャッシュされたセクション

source: Cached build artifacts
ja_jp: キャッシュされたビルドアーティファクト

source: Caches frequently-accessed resources (like service loader files) to avoid classpath scanning at runtime
ja_jp: 実行時のクラスパススキャンを避けるため、頻繁にアクセスされるリソース (サービスローダーファイルなど) をキャッシュする

source: Caches store the data in separate regions to isolate different portions of data; such regions are assigned a name, which is useful for configuring each region independently, or to monitor their statistics.
ja_jp: キャッシュはデータの異なる部分を分離するために別々の領域にデータを保存します。このような領域には名前が付けられ、各領域を独立して設定したり、統計を監視したりするのに役立ちます。

source: Caching
ja_jp: キャッシング

source: Caching (non-CI)
ja_jp: キャッシング（非CI）

source: Caching annotations are not allowed on private methods. They will work fine with any other access modifier including package-private (no explicit modifier).
ja_jp: プライベートメソッドではアノテーションのキャッシュは許可されていません。package-private (明示的な修飾子を持たない) を含む他のアクセス修飾子では問題なく動作します。

source: Caching class loading is within the scope of Leyden, but Leyden does not cache negative lookups. Why? Because Leyden, while AOT, is still true Java. Java is a dynamic language: even if a class wasn't present when you recorded the cache, it might be added later. Now, in practice, that's often not the case, especially in Quarkus, where we assume a closed world, but Leyden cannot rely on that assumption.
ja_jp: クラスロードのキャッシュは Leyden のスコープ内ですが、Leyden はネガティブキャッシュ (存在しないことのキャッシュ) は行いません。なぜでしょうか？Leyden は AOT (事前コンパイル) ですが、依然として真の Java だからです。Java は動的な言語です。キャッシュを記録したときにクラスが存在しなかったとしても、後で追加されるかもしれません。実際には、特に「閉じた世界 (closed world)」を前提とする Quarkus ではそうではないことが多いのですが、Leyden はその前提に頼ることはできません。

source: Caching in CI
ja_jp: キャッシング（CI）

source: Caching of collections and relations
ja_jp: コレクションとリレーションのキャッシング

source: Caching of entities
ja_jp: エンティティのキャッシュ

source: Caching of queries
ja_jp: クエリのキャッシュ

source: Caching the Result of Programmatic Lookup
ja_jp: プログラムによるルックアップの結果をキャッシュする

source: Caching using annotations
ja_jp: アノテーションを利用したキャッシング

source: Caching using the programmatic API
ja_jp: プログラムAPIを使ったキャッシング

source: Caching values
ja_jp: 値のキャッシュ

source: Caching verification and Userinfo results
ja_jp: 検証結果と UserInfo 結果のキャッシュ

source: Caffeine configuration properties
ja_jp: Caffeine設定プロパティ

source: Calculate SHA256 (default) checksums for all input files.
ja_jp: すべての入力ファイルに対してSHA256（デフォルト）のチェックサムを計算します。

source: Call REST services
ja_jp: REST サービスを呼び出す

source: Call Tree Reports
ja_jp: コールツリーレポート

source: Call `native-image` with the content of file `native-image.args` as arguments. We also supply an additional argument to limit the process's maximum memory to 4 Gigabytes (this may vary depending on the project being built and the machine building it).
ja_jp: ファイル `native-image.args` の内容を引数として `native-image` を呼び出します。また、プロセスの最大メモリーを 4 ギガバイトに制限するための追加の引数も提供します (これは、ビルドするプロジェクトとそれをビルドしているマシンにより異なります)。

source: Call a method that wraps the original `testPrimeNumber` method.
ja_jp: 元の `testPrimeNumber` メソッドをラップするメソッドを呼び出します。

source: Call an anchored ID from a different file
ja_jp: 別のファイルからアンカー ID を呼び出す

source: Call an anchored ID in the same file
ja_jp: 同じファイル内のアンカー ID の呼び出し

source: Call into the runtime recorder to record the creation of the service.
ja_jp: ランタイムレコーダーを呼び出して、サービスの作成を記録します。

source: Call the `/admin-name-with-oidc-client-token-header-param-blocking`. In contrast with the preceding command, this command returns a `403` status code:
ja_jp: `/admin-name-with-oidc-client-token-header-param-blocking` を呼び出します。前のコマンドとは対照的に、このコマンドは `403` ステータスコードを返します。

source: Call the `/admin-name-with-oidc-client-token-header-param`. In contrast with the preceding command, this command returns a `403` status code:
ja_jp: `/admin-name-with-oidc-client-token-header-param` を呼び出します。前のコマンドとは対照的に、このコマンドは `403` ステータスコードを返します。

source: Call the `/user-name-with-oidc-client-token-header-param-blocking`. This command returns the `200` status code and the name `alice`:
ja_jp: `/user-name-with-oidc-client-token-header-param-blocking` を呼び出します。このコマンドは、 `200` ステータスコードと名前 `alice` を返します。

source: Call the `/user-name-with-oidc-client-token-header-param`. This command returns the `200` status code and the name `alice`:
ja_jp: `/user-name-with-oidc-client-token-header-param` を呼び出します。このコマンドは、 `200` ステータスコードと名前 `alice` を返します。

source: Call the method to be timed and store the boolean result
ja_jp: 時間を計測するメソッドを呼び出し、ブール値の結果を保存します

source: Call the method to call the remote
ja_jp: リモートを呼び出すためにメソッドを実行

source: Call the runtime recorder to record the bean interactions.
ja_jp: ランタイムレコーダーを呼び出して、Bean のインタラクションを記録します。

source: Call the runtime recorder to record the service start invocation.
ja_jp: ランタイムレコーダーを呼び出して、サービス開始の呼び出しを記録します。

source: Callback methods
ja_jp: コールバックメソッド

source: Calling All Roadies for the Quarkus World Tour
ja_jp: Quarkus ワールド・ツアーのローディーを大募集

source: Calling Cloud provider services
ja_jp: クラウドプロバイダーサービスの呼び出し

source: Calling `await` or `toIterable` would fail if you are running on an I/O thread, preventing blocking the I/O thread;
ja_jp: I/O スレッドで実行している場合は `await` や `toIterable` を呼び出すと失敗し、I/O スレッドのブロックを防ぎます。

source: Calling `classProxy` with a given class name will create a `Class` that can be passed into recorder methods, and at runtime will be substituted with the class whose name was passed in to `classProxy`. This is basically a convenience to avoid the need to explicitly load classes in the recorders.
ja_jp: 与えられたクラス名で `classProxy` を呼び出すと、レコーダーのメソッドに渡すことができる `Class` が作成され、実行時には `classProxy` に渡された名前のクラスで置き換えられます。これは基本的に、レコーダで明示的にクラスをロードする必要性を避けるための便宜的なものです。

source: Calling `classProxy` with a given fully-qualified class name will create a `Class` instance that can be passed into a recorder method, and at runtime will be substituted with the class whose name was passed in to `classProxy()`. However, this method should not be needed in most use cases because directly loading deployment/application classes at processing time in build steps is safe. Therefore, this method is deprecated. Nonetheless, there are some use cases where this method comes in handy, such as referring to classes that were generated in previous build steps using `GeneratedClassBuildItem`.
ja_jp: 指定された完全修飾クラス名で `classProxy` を呼び出すと、レコーダーメソッドに渡すことができる `Class` インスタンスが作成されます。 これは実行時に `classProxy()` に名前が渡されたクラスに置き換えられます。 しかし、ビルドステップの処理時にデプロイメント/アプリケーションクラスを直接ロードすることは安全であるため、ほとんどのユースケースでは、このメソッドを使用する必要はありません。 そのため、このメソッドは非推奨となりました。 それでも、以前のビルドステップで `GeneratedClassBuildItem` を使用して生成されたクラスを参照する場合など、一部のユースケースではこのメソッドが便利な場合があります。

source: Calling such service method, e.g. in your rest end point, triggers the `Book` validation automatically:
ja_jp: このようなサービスメソッドを、例えば RESTエンドポイントで呼び出すと、`Book` の検証が自動的にトリガーされます。

source: Calling the service in your rest end point triggers the `Book` validation automatically:
ja_jp: RESTエンドポイントでサービスを呼び出すと、自動的に `Book` の検証が行われます。

source: Calling this method WILL NOT invalidate values cached by the `load` method because the key elements order is different.
ja_jp: このメソッドを呼び出すと、キー要素の順序が異なるため、 `load` メソッドでキャッシュされた値が無効になることはありません。

source: Calling this method WILL invalidate values cached by the `load` method because the key elements order is the same.
ja_jp: このメソッドを呼び出すと、キー要素の順序が同じなので、 `load` メソッドでキャッシュされた値が無効になります。

source: Calling this method WILL invalidate values cached by the `load` method even if the key elements names have been swapped.
ja_jp: このメソッドを呼び出すと、キー要素名が入れ替わっていても `load` メソッドでキャッシュされた値が無効になります。

source: Camel 3.14 is the new LTS version of Camel. Compared to the previous LTS version (3.11), a lot of work has been done to bring new components, CamelJbang and Java 17 support. Improvements have been made to Core performance, Route configuration, and many components such as Kamelets and Kafka. For more details, check https://camel.apache.org/blog/2021/12/camel314-whatsnew/[Apache Camel 3.14 What’s New].
ja_jp: Camel 3.14は、Camelの新しいLTSバージョンです。前のLTSバージョン(3.11)と比較して、新しいコンポーネント、CamelJbang、Java 17のサポートのために多くの作業が行われました。また、Coreのパフォーマンス、Routeの設定、KameletやKafkaなどの多くのコンポーネントにも改良が加えられています。詳しくは link:https://camel.apache.org/blog/2021/12/camel314-whatsnew/[Apache Camel 3.14 What's New]をご覧ください。

source: Camel JFR Native support
ja_jp: Camel JFR ネイティブ対応

source: Camel JFR extension allows diagnosing Camel applications with Java Flight Recorder. The extension has been introduced in Camel Quarkus 1.7.0 with JVM support only. The extension is now fully supported in JVM mode and Native mode.
ja_jp: Camel JFRエクステンションは、Java Flight RecorderでCamelアプリケーションを診断することができます。このエクステンションは、Camel Quarkus 1.7.0で導入され、JVMのみのサポートでした。このエクステンションは、JVMモードとNativeモードで完全にサポートされています。

source: Camel Quarkus extensions have been upgraded to Camel 3.13.0 version, that brings a list of improvements and fixes. Check the https://camel.apache.org/releases/release-3.13.0/[Camel 3.13.0 release notes].
ja_jp: Camel Quarkus extensionsがCamel 3.13.0にアップグレードされ、様々な改善や修正が行われました。 link:https://camel.apache.org/releases/release-3.13.0/[Camel 3.13.0のリリースノート]をご覧ください。

source: Camel Quarkus to 3.33.0
ja_jp: Camel Quarkus を 3.33.0 に

source: Can I build and run this examples outside a container in Linux?
ja_jp: このサンプルをコンテナーの外で Linux でビルドして実行することは可能ですか？

source: Can I build and run this examples outside of a container in Linux?
ja_jp: このサンプルをコンテナの外でLinuxでビルドして実行することは可能ですか？

source: Can I get a heap dump of a native executable? e.g. if it runs out of memory
ja_jp: ネイティブ実行可能ファイルのヒープダンプを取得することはできますか？ 例えば、メモリ不足になった場合などです。

source: Can I get a thread dump of a native executable?
ja_jp: ネイティブ実行可能ファイルのスレッドダンプを取得できますか?

source: Can I reuse this setup for an extension outside the Quarkiverse organization?
ja_jp: この設定をQuarkiverseの組織外のエクステンションに再利用することはできますか?

source: Can I use Gradle to build my extension?
ja_jp: エクステンションをビルドするために Gradle を使用できますか?

source: Can I use JFR/JMC to debug or profile native binaries?
ja_jp: JFR/JMCを使って、ネイティブバイナリのデバッグやプロファイリングはできますか？

source: Can I use io_uring on my Linux machine?
ja_jp: Linuxマシンでio_uringは使えますか？

source: Can I use setter and constructor injection?
ja_jp: セッターやコンストラクタのインジェクションは使えますか?

source: Can I write an extension?
ja_jp: エクステンションを作成できますか?

source: Can also be set to built-in implementations through <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-elasticsearch-layout-strategy,`quarkus.hibernate-search-orm.elasticsearch.layout.strategy`>>.
ja_jp: <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-elasticsearch-layout-strategy,`quarkus.hibernate-search-orm.elasticsearch.layout.strategy`>> を介して組み込み実装に設定することもできます。

source: Can also be set to built-in implementations through <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-orm.indexing.plan.synchronization.strategy`>>.
ja_jp: <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-orm.indexing.plan.synchronization.strategy`>> を介して組み込み実装に設定することもできます。

source: Can also be set to built-in implementations through <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-elasticsearch-layout-strategy,`quarkus.hibernate-search-standalone.elasticsearch.layout.strategy`>>.
ja_jp: <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-elasticsearch-layout-strategy,`quarkus.hibernate-search-standalone.elasticsearch.layout.strategy`>> を介して組み込み実装に設定することもできます。

source: Can also be set to built-in implementations through <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-standalone.indexing.plan.synchronization.strategy`>>.
ja_jp: <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-indexing-plan-synchronization-strategy,`quarkus.hibernate-search-standalone.indexing.plan.synchronization.strategy`>> を介して組み込み実装に設定することもできます。

source: Can be executed globally or in a specific extension directory (e.g. `extensions/mailer`).
ja_jp: グローバルまたは特定のエクステンションディレクトリ（例： `extensions/mailer` ）で実行することができます。

source: Can be used to specify an empty set of contexts, but setting the value to empty works too
ja_jp: コンテキストの空のセットを指定するために使用できますが、値を空に設定しても機能します。

source: Can only be used in a @RestControllerAdvice class, not on a per-controller basis
ja_jp: コントローラごとではなく、@RestControllerAdviceクラスでのみ使用可能です

source: Can the content be re-organized to make it simpler to consume?
ja_jp: コンテンツをよりシンプルに消費できるように再編成することは可能か？

source: Can the content be reorganized to make it simpler to consume?
ja_jp: コンテンツをより消費しやすいように再設定できないか?

source: Canonical equivalent
ja_jp: 正規の同等表現

source: Capabilities can be registered in a <<Build Step Processors>> method that produces a `CapabilityBuildItem`:
ja_jp: ケイパビリティは、 `CapabilityBuildItem` を生成する link:#Build Step Processors[[Build Step Processors]]メソッドで登録することができます。

source: Capabilities can be registered in a <<build-step-processors>> method that produces a `CapabilityBuildItem`:
ja_jp: 機能は、 `CapabilityBuildItem` を生成する <<build-step-processors>> メソッドに登録することができます。

source: Capabilities produced from extension build steps aren't available for the Quarkus dev tools. As a consequences, such capabilities can not be taken into account when analyzing extension compatibility during project creation or when adding new extensions to a project.
ja_jp: エクステンションのビルドステップから生成されたケイパビリティは、Quarkus開発ツールでは利用できません。そのため、プロジェクト作成時にエクステンションの互換性を分析する際や、プロジェクトに新しいエクステンションを追加する際に、そのような機能を考慮することはできません。

source: Capabilities should follow the naming conventions of Java packages; e.g. `io.quarkus.security.jpa`. Capabilities provided by core extensions should be listed in the `io.quarkus.deployment.Capability` enum and their name should always start with the `io.quarkus` prefix.
ja_jp: ケイパビリティは、 `io.quarkus.security.jpa` のように、Java パッケージの命名規則に従う必要があります。コアエクステンションによって提供されるケイパビリティは、 `io.quarkus.deployment.Capability` 列挙型にリストされている必要があり、それらの名前は常に `io.quarkus` の接頭辞で始まる必要があります。

source: Capability prefixes
ja_jp: ケイパビリティ接頭辞

source: Capability promises and requirements are described in Quarkus extension descriptors - `META-INF/quarkus-extension.properties` entries of the runtime extension JAR artifacts.
ja_jp: ケイパビリティの約束と要件は、Quarkusエクステンション記述子（ランタイムエクステンションJARアーティファクトの `META-INF/quarkus-extension.properties` エントリ）に記述されます。

source: Capture the caller Vert.x context.
ja_jp: 呼び出し元の Vert.x コンテキストをキャプチャーします。

source: Capturing Logs
ja_jp: ログの取得

source: Card component to display contents in a card
ja_jp: カード内のコンテンツを表示する Card コンポーネント。

source: Cards
ja_jp: カード

source: Carrier thread
ja_jp: キャリアースレッド

source: Case 1: The library uses a metrics library directly
ja_jp: ケース1：ライブラリがメトリクス・ライブラリを直接利用する場合

source: Case 1: implicit configuration
ja_jp: ケース 1: 暗黙的な設定

source: Case 2: The library provides its own metric API
ja_jp: ケース 2: ライブラリーが独自のメトリクス API を提供している

source: Case 2: minimal explicit configuration
ja_jp: ケース 2: 最小限の明示的な設定

source: Case 3: It is necessary to collect metrics within the extension code
ja_jp: ケース3：エクステンションコード内でメトリクスを収集する必要がある

source: Case 3: multiple services registrars
ja_jp: ケース 3: 複数のサービスレジストラ

source: Case 4: disabling registration
ja_jp: ケース 4: 登録の無効化

source: Case 5: advanced health check configuration
ja_jp: ケース 5: 高度なヘルスチェック設定

source: Case 6: static IP and port
ja_jp: ケース 6: 静的な IP とポート

source: Categories
ja_jp: カテゴリー

source: Categories the extension should appear under on https://code.quarkus.io[code.quarkus.io]. This field can be omitted, the extension will still be listed on https://code.quarkus.io[code.quarkus.io] but won't be categorized
ja_jp: https://code.quarkus.io[code.quarkus.io] でエクステンションが表示されるカテゴリー。このフィールドを省略しても、エクステンションは引き続き https://code.quarkus.io[code.quarkus.io] にリストされますが、カテゴリーには分類されません

source: Category
ja_jp: カテゴリ

source: Category: Web
ja_jp: カテゴリー: Web

source: Caveats for Cryostat with Quarkus
ja_jp: Quarkusを使用したCryostatの注意点

source: Centralized Log Management
ja_jp: 集中ログ管理

source: Centralized log management
ja_jp: ログの一元管理

source: Centralized log management (Graylog, Logstash, Fluentd)
ja_jp: ログの一元管理（Graylog、Logstash、Fluentd）
